essays/permissions101.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Unix Permissions 101</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Anurag Peshne" />
<link rel="stylesheet" type="text/css" href="../css/style.css" />
<link href='https://fonts.googleapis.com/css?family=Lato' rel='stylesheet' type='text/css'/>
<link rel="canonical" href="https://anuragpeshne.github.io/essays/permissions101.html" />
</head>
<body>
<div id="content">
<h1 class="title">Unix Permissions 101</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. Multiple servers, multiple configs</a>
<ul>
<li><a href="#orgheadline1">1.1. Debugging</a></li>
<li><a href="#orgheadline2">1.2. Analysis</a></li>
</ul>
</li>
<li><a href="#orgheadline6">2. <code>sudo</code></a>
<ul>
<li><a href="#orgheadline4">2.1. <code>sudo</code> justExecuteThis</a></li>
<li><a href="#orgheadline5">2.2. <code>sudo</code> mode</a></li>
</ul>
</li>
<li><a href="#orgheadline7">3. Unix Permissions 101</a></li>
</ul>
</div>
</div>
<script> (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o), m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)})(window,document,'script','//www.google-analytics.com/analytics.js','ga'); ga('create', 'UA-67524931-1', 'auto'); ga('send', 'pageview'); </script>
<div id="draftTag">DRAFT</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> Multiple servers, multiple configs</h2>
<div class="outline-text-2" id="text-1">
<p>
Couple of days ago we discovered a nasty bug in one of our systems. Before
getting to the bug let me explain the setup very briefly:
</p>
<p class="verse">
We have a master node which wakes up several AWS instances, delegates series of jobs, from a queue, to them and after all of the jobs are completed switches them off. Each slave node, after completing a job, stores the result in a common database.<br  />
<br  />
Each of the event is logged in the same common database.<br  />
</p>
<p>
The system was working as expected until we found that the results calculated
by the slave nodes are being stored in a development database and not in the
production database.
Initially it looked like we plugged in wrong configuration file, which of course
wasn't the case. I checked the code that talked to the database to see if
someone hard coded the Dev DB configuration and later forgot to revert. Nothing
helped.
</p>

<p>
I even considered the possibility of multiple configuration files and
tried grepping the whole repository for Dev DB credential. Nothing was
mentioned anywhere about the Dev DB.
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Debugging</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The master node packs the Python scripts, configuration files and other data
files nicely in an egg (zip file) and deploys it to the slave nodes. I sshed
into one of the slaves and to my horror saw that the job did have configuration
of the Dev DB! This was surprising since while the master node didn't have a
trace of the incorrect configuration, the egg contained it.
</p>

<p>
My job was now a bit easier, I just needed to figure out how the unwanted
configuration slipped into the egg. I went over the code and double checked the
path of configuration declared for making the egg. Ultimately, I manually executed
the script that does the zipping of code and deployment. I found that the zipping
operation failed due to insufficient permissions. <code>ls -l</code> revealed that the
<code>build</code> folder was owned by the <code>root</code> and was <b>readonly</b> for others. The script
couldn't clean the temporary files and failed. Since this operation was done
using Python <code>subprocess</code> and the exception was handled in a way that didn't
stop the script, the script went on failing to deploy to each slave.
</p>

<p>
When the slaves were ordered to execute the job, they executed the last available
version of the egg, which happened to be a job which was being tested on development
server and thus contained development configuration.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Analysis</h3>
<div class="outline-text-3" id="text-1-2">
<p>
After the file permissions were fixed, it was time for examining what went wrong.
And what could have been done so that finding the cause would have been easier.
The fatal mistake was to handle the <code>subprocess</code> exception and not stop. This
is exactly opposite of the Unix Philosophy<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>:
</p>
<blockquote>
<p>
Rule of Repair: Repair what you can — but when you must fail, fail noisily and as soon as possible.
</p>
</blockquote>
<p>
Instead of silently consuming the exception, the script should have failed and
log it. Still this isn't the root cause of the bug. The root cause is setting
up of incorrect file permissions.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> <code>sudo</code></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> <code>sudo</code> justExecuteThis</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The main problem is not technical but, like most of the other problems in software
development, a social one. We want to get things working, fast. Unable to save
a file? - use <code>sudo</code>. Unable to install package? - use <code>sudo</code>. I can bet most of
the engineer would repeat the last command, if it failed, prefixing it with <code>sudo</code>
without giving it a thought. For most of us, <code>sudo</code> means:
</p>
<p class="verse">
I don't really understand (or want to know) why you failed but I don't want you to fail.<br  />
Here, I give you the power of <code>sudo</code><br  />
</p>
<p>
Again, the problem is not technical. Fixing the permission is not very difficult.
But why would one get into the trouble of actually reading up the commands and
doing it the right way, when one can just <code>sudo</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.2</span> <code>sudo</code> mode</h3>
<div class="outline-text-3" id="text-2-2">
<p>
After one has successfully executed couple of commands using <code>sudo</code>, which were
failing earlier, it is very tempting to get into <b>sudo mode</b> &#x2013; <code>su</code>. Switch
to superuser and one never have to type in <code>sudo</code> again.
</p>

<p>
Using <code>su</code> (login as superuser) we can go anywhere and do anything we wish,
there is no one to stop us. But whenever we create a new file, other ordinary
users may only be able to read it and not write it.
</p>

<p>
Most of the code we write is executed by non privileged users.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">3</span> Unix Permissions 101</h2>
<div class="outline-text-2" id="text-3">
<p>
There are just 3 commands one needs to know to avoid 90% of the unnecessary
use of <code>sudo</code>.
</p>
<ol class="org-ol">
<li><p>
<code>ls -l</code> (list directory with a long listing format<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>):
</p>

<p>
This is the usual <code>ls</code> with <code>-l</code> flag which outputs extra information about
the files in the directory.
</p>
<div class="org-src-container">

<pre class="src src-bash">-rw-r--r--  1 anuragpeshne  staff  1080 Feb  2 20:52 LICENSE
-rw-r--r--  1 anuragpeshne  staff    51 Feb  2 20:52 README.md
drwxr-xr-x  7 anuragpeshne  staff   238 May  1 20:57 assets
drwxr-xr-x  3 anuragpeshne  staff   102 May 21 16:15 css
drwxr-xr-x  9 anuragpeshne  staff   306 Jun  5 13:45 essays
-rw-r--r--@ 1 anuragpeshne  staff    53 Feb 28 20:41 googleb7e54271b39d6266.html
-rw-r--r--  1 anuragpeshne  staff  8556 Apr  2 00:11 index.html
drwxr-xr-x  3 anuragpeshne  staff   102 Apr  1 22:32 js
-rw-r--r--  1 anuragpeshne  staff  6565 Feb 20 23:08 now.html
drwxr-xr-x  8 anuragpeshne  staff   272 Apr  2 00:11 org-files
drwxr-xr-x  4 anuragpeshne  staff   136 Feb 21 23:02 quotes
drwxr-xr-x  3 anuragpeshne  staff   102 Feb 16 20:09 todo
</pre>
</div>
<p>
The first 10 characters denote file permissions. The first character denotes
whether the file is regular file or directory<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>. 3 Sets of 3 characters
follow that. Each character in the set denotes whether it is [w]ritable,
e[x]ecutable or [r]eadble. The sets represents permission of Owner, Group and
Other. The third, fourth column gives the information about owner and group.
</p>

<p>
Thus in the above example, only <code>anuragpeshne</code> can write to file <code>README.md</code>
while users in group <code>staff</code> and others can just read it.
</p></li>
<li><p>
<code>chown</code> (change owner<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>):
</p>

<p>
If you are working in some folder above your home folder, most probably it
won't be owned by you; It will be owned by <code>root</code>. If you are editing files
in your repository and going to edit those many times in a day, it would be
a good idea to own the repository folder.
</p>

<p>
<code>sudo chown -R $(whoami) ./</code>
</p></li>
<li><p>
<code>chmod</code> (change mode<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>):
</p>

<p>
There are couple of ways to change file permissions, but I'm going to mention
just one way. <code>chmod ugo file</code>, where <code>ugo</code> are octal values representing permission
for <code>user</code>, <code>group</code> and <code>others</code>. For calculating these octal value, just add
up the number corresponding to the permission you want to give.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">read</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">write</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">execute</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
<p>
Examples:
</p>
<ul class="org-ul">
<li><code>chmod 600 d.txt</code> will give permission to read and write only to the user
(owner).</li>
<li><code>chmod 755 app</code> will give permission to read and execute to everyone but only
the user can write to it.</li>
</ul></li>
</ol>

<p>
And that's it! From now on whenever you are tempted to use <code>sudo</code>, give yourself
a moment to think if you are going to edit the file often, if so, change the
ownership to you or add yourself to the owner group.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
: <a href="http://www.catb.org/esr/writings/taoup/html/ch01s06.html">Rule of Repair</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
: <a href="http://ss64.com/bash/ls.html">ls</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
: The first character can denote much more than directories, symlinks, regular files, but that's out of scope of this article.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
: <a href="http://ss64.com/bash/chown.html">chown</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
: <a href="http://ss64.com/bash/chmod.html">chmod</a>
</p></div></div>


</div>
</div><div id="disqus_thread"></div>
<script>
    var disqus_config = function () {
this.page.url = "https://anuragpeshne.github.io/essays/permissions101.html";
this.page.identifier = "/essays/permissions101.html";
};
    (function() {  // DON'T EDIT BELOW THIS LINE
        var d = document, s = d.createElement('script');

        s.src = '//anuragpeshne.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript></div>
<div id="postamble" class="status">
<p class="date">Date: 2016-05-19</p>
<p class="author">Author: Anurag Peshne</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.3.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
